Tekla.Structures.Model.InputItem.InputTypeEnum
Defines the type of the input.

Tekla.Structures.Model.InputItem.InputTypeEnum.INPUT_1_POINT
The input is one point. The data is returned as a point.

Tekla.Structures.Model.InputItem.InputTypeEnum.INPUT_2_POINTS
The input is two points. The data is returned as an array list of points.

Tekla.Structures.Model.InputItem.InputTypeEnum.INPUT_POLYGON
The input is any number of points (a polygon). The data is returned as an array list of points.

Tekla.Structures.Model.InputItem.InputTypeEnum.INPUT_1_OBJECT
The input is one model object. The data is returned as a model object.

Tekla.Structures.Model.InputItem.InputTypeEnum.INPUT_N_OBJECTS
The input is any number of model objects. The data is returned as an array list of model objects.